---
kind: property
id: P:Autodesk.Revit.DB.Lighting.CustomInitialColor.Temperature
source: html/856ff1a5-c6c4-207f-88a3-aec9a4792f4b.htm
---
# Autodesk.Revit.DB.Lighting.CustomInitialColor.Temperature Property

The custom color temperature value.

## Syntax (C#)
```csharp
public double Temperature { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The color temperature is not valid because it is not in the range of 1800 to 20000.